#include <iostream>

#include "Algoritme_and_Functure.h"


//алгоритми пошуку Search_End() - серед всіх елементів
template<class T>
void Search_End(T * end, T* to) {
	T* from = end - 4;		//останне входження 4 елементів контейнера(масива)
	for (; from < end; from++) {		// from - ітератор вхідного контейнера
		*to = *from;	// скопіювали елемент
		to++;			//перейшли на наступну позицію
	}
}

//алгоритми пошуку search_end_if() - серед тих елементів, які задовольняють умові
template<class T>
int Search_End_if(T* end, T* to, Predicate<T>& p) {
	int n = 0;				//n - кількість елементів у результуючому контейнері
	T* from = end - 4;		//останне входження 4 елементів контейнера(масива)

	for (; from < end; from++)		// from - ітератор вхідного контейнера
		if (p(*from)) {		// якщо справджується умова предикату
			*to = *from;	// скопіювали елемент
			to++;			//перейшли на наступну позицію
			n++;			//лічильник(кількість елементів у результуючому контейнері) збільшився
		}

	return n;
}